<?php
/* 1 Задача.
Создать две целочисленных переменных и вывести 
на экран результат выполнения над ними математических операторов.
*/

//$num1 = 5;
//$num2 = 8;
//
//echo ($num1+$num2)*$num2/($num1+$num1); //10.4






/* 2 Задача.
Даны два числа. 
Найдите сумму их квадратов
*/

//$num1 = 5;
//$num2 = 8;
//
//$sum_squ = $num1*$num1+$num2*$num2; //89, или
//
//$sum_squ2 = $num1**2+$num2**2; //89







/* 3 Задача.
Рассчитать скорость движения машины 
и вывести её в удобочитаемом виде. 
Вывод в км/ч, м/c.
Исходные данные: Пройденный путь - S; Время движения - t.
*/

//$var_S = 120;
//$var_t = 2;
//
//$var_V = $var_S/$var_t;
//
////echo $var_V.' км/ч';
//
//$var_V2 = ($var_S/$var_t)/3.6;
//
//echo sprintf("%.1f", $var_V2).' м/c';






/* 4 Задача.
Создайте константу и присвойте ей значение. 
Выведите значение созданной константы. 
Попытайтесь изменить ее значение.
*/

//$var1 = 1;
//$var2 = 2;
//
//define ('INTEG', $var1);
//
//define ('INTEG', $var2);
//
//echo INTEG; // значение не переопределяется

?> 





















