<?php
/**
 * Created by PhpStorm.
 * User: s_i_d
 * Date: 13.05.2017
 * Time: 4:19
 */
define("TITLE", "ITMO HOME TASKs", true);
define("TASK1", "1. Создать две целочисленных переменных и вывести на экран
 результат выполнения над ними математических операторов.", true);
define("TASK2", "2. Даны два числа. Найдите сумму их квадратов. ", true);
define("TASK3", "3. Рассчитать скорость движения машины и вывести её в удобочитаемом виде.
   Вывод в км/ч, м/c. Исходные данные: Пройденный путь - S; Время движения - t..", true);
define("TASK4", "4. Создайте константу и присвойте ей значение.
Выведите значение созданной константы. Попытайтесь изменить ее значение.", true);

?>