<?php
define("TASK01","
Задание 1:
Создать массив из дней недели.
С помощью цикла foreach вывести все дни недели,
а текущий день выведите жирным.
Текущий день можно получить с помощью функции date
Названия дней выводить по-русски", true);

define("TASK02","
Задание 2:
Доделать задачу про счастливые билетики - вывести процент от общего числа билетов", true);

define("TASK03","
Задание 3:
Создать переменную, присвоить ей значение - год.
Используя тернарный оператор определить, високосный год или нет", true);

define("TASK04","
Задание 4:
Вывести все положительые числа, меньше 40,
у которых есть хотя бы одна цифра 3
и которые не делятся на 5.", true);

define("TASK05","
Задание 5:
Нарисовать ромб из символов * . Высота произвольная", true);

define("TASK06","
Задание 6:
Вывести таблицу умножения чисел до 10 с помощью циклов for", true);

define("TASK07","
Задание 7**:
Отсортировать массив по 'price'
\$arr = [
    '1'=> [
        'price' => 10,
        'count' => 2
        ],
    '2'=> [
        'price' => 5,
        'count' => 5
        ],
    '3'=> [
        'price' => 8,
        'count' => 5
        ],
    '4'=> [
         'price' => 12,
         'count' => 4
         ],
    '5'=> [
        'price' => 8,
        'count' => 4
        ],
];

И посмотрите функции для работы с массивами!", true);
?>