<?php
echo 'Задание 1:<br/>
-----------------------------------<br/>
Создать массив из дней недели.<br/>
С помощью цикла foreach вывести все дни недели,<br/>
а текущий день выведите жирным.<br/>
Текущий день можно получить с помощью функции date<br/>
Названия дней выводить по-русски<br/>
-----------------------------------<br/>';
$days = [
	"Monday" => "Понедельник",
    "Tuesday" => "Вторник",
    "Wednesday" => "Среда",
    "Thursday" => "Четверг",
    "Friday" => "Пятница",
    "Saturday" => "Суббота",
    "Sunday" => "Воскресенье",
];
$today = date('l');
#echo $today;
foreach ($days as $key => $value) {
	if($key == $today){
		echo '<strong>'.$value.'</strong>'.'<br/>';
	} else {
		echo $value."<br/>";
	}
};
echo '<br/>Задание 2:<br/>
-----------------------------------<br/>
Доделать задачу про счастливые билетики <br/>- вывести процент от общего числа билетов<br/>
-----------------------------------<br/>';
$i = 0;
$sum_lucky = 0;
$prc_lucky = 0;
while ($i < 1000000) {
    $ticket =  str_pad($i, 6, '0', STR_PAD_LEFT);
    $fhalf = substr($ticket, 0, 3);
    $shalf = substr($ticket, 3);
    $first_sum = $fhalf[0] + $fhalf[1] + $fhalf[2];
    $second_sum = $shalf[0] + $shalf[1] + $shalf[2];
    if ($first_sum == $second_sum) {
        $sum_lucky++;
    }
    $i++;
}
$prc_lucky = (int)($sum_lucky/10000);
echo "Процент счастливых от общего числа билетов: $prc_lucky%";

echo '<br/><br/>Задание 3:<br/>
-----------------------------------<br/>
Создать переменную, присвоить ей значение - год.<br/>
Используя тернарный оператор определить, високосный год или нет<br/>
-----------------------------------<br/>';
$year = 2017;
$vis = '';
echo $year.'<br/>';
(($year%400)==0 || ($year%4)==0) ? $vis = 'Високосный' : $vis = 'Невисокосный';
echo $vis;

echo '<br/><br/>Задание 4:<br/>
-----------------------------------<br/>
Вывести все положительые числа, меньше 40,<br/>
у которых есть хотя бы одна цифра 3<br/>
и которые не делятся на 5.<br/>
-----------------------------------<br/>';
$str_num = '';
for ($j = 0; $j < 40; $j++) {
    $str_num = (string)$j;
    if ((($str_num[0] == 3) || ($str_num[1] == 3)) 
        && ($j%5 != 0)) {
        echo "$j///";
    }
}

echo '<br/><br/>Задание 5:<br/>
-----------------------------------<br/>
Нарисовать ромб из символов * . Высота произвольная<br/>
-----------------------------------<br/>';


echo '<br/><br/>Задание 6:<br/>
-----------------------------------<br/>
Вывести таблицу умножения чисел до 10 с помощью циклов for<br/>
-----------------------------------<br/>';
$rez = 0;
for ($i = 1; $i < 11; $i++) {
    for ($j = 1; $j < 11; $j++) {
        $rez = $i * $j;
        echo "$i * $j = $rez<br>";
    }
    echo '<br>';
}

echo '<br/><br/>Задание 7:<br/>
-----------------------------------<br/>
Отсортировать массив по price<br/>
-----------------------------------<br/>';
$arr = [
    '1'=> [
        'price' => 10,
        'count' => 2
        ],
    '2'=> [
        'price' => 5,
        'count' => 5
        ],
    '3'=> [
        'price' => 8,
        'count' => 5
        ],
    '4'=> [
         'price' => 12,
         'count' => 4
         ],
    '5'=> [
        'price' => 8,
        'count' => 4
        ],
];
$n = count($arr);
for ($i = 0; $i < $n-1; $i++) {
        for ($j = 1; $j < $n-$i; $j++) {
            $a = $arr[$j]["price"];
            $b = $arr[$j+1]["price"];
            if ((int)$b < (int)$a) { 
                $t = $arr[$j+1];
                $arr[$j+1] = $arr[$j];
                $arr[$j] = $t; 
                }
            }
     }  
var_dump($arr);